### Exploratory Data Analysis using SQL

In [56]:
import pandas as pd

In [57]:
import sqlalchemy

In [58]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [59]:
%sql postgresql://postgres:postgres@localhost/demo

We begin by examining the columns' data types for the tables to ensure that
the data is correctly formatted and to understand the structure of the dataset.   
This step is crucial for validating data integrity and preparing for subsequent analysis.

In [60]:
%%sql
SELECT column_name, data_type, is_nullable
FROM information_schema.columns
WHERE table_name = 'orders';

 * postgresql://postgres:***@localhost/demo
5 rows affected.

[('order_id', 'text', 'YES'),
 ('order_date', 'text', 'YES'),
 ('customername', 'text', 'YES'),
 ('state', 'text', 'YES'),
 ('city', 'text', 'YES')]

In [61]:
%%sql
SELECT column_name, data_type, is_nullable
FROM information_schema.columns
WHERE table_name = 'details';

 * postgresql://postgres:***@localhost/demo
7 rows affected.

[('quantity', 'bigint', 'YES'),
 ('amount', 'bigint', 'YES'),
 ('profit', 'bigint', 'YES'),
 ('order_id', 'text', 'YES'),
 ('category', 'text', 'YES'),
 ('sub_category', 'text', 'YES'),
 ('paymentmode', 'text', 'YES')]

Next, we check for missing values in the columns of both tables. This will help us identify any gaps in the dataset that need to be addressed before   
proceeding with the analysis.

In [62]:
%%sql
SELECT
COUNT(*) AS total_rows,
COUNT(order_id) AS non_null_order_id,
COUNT(customername) AS non_null_customername,
COUNT(state) AS non_null_state,
COUNT(city) AS non_null_city
FROM orders;

 * postgresql://postgres:***@localhost/demo
1 rows affected.

[(500, 500, 500, 500, 500)]

In [63]:
%%sql
SELECT
COUNT(*) AS total_rows,
COUNT(order_id) AS non_null_order_id,
COUNT(amount) AS non_null_amount,
COUNT(quantity) AS non_null_quantity,
COUNT(profit) AS non_null_profit,
COUNT(sub_category) AS non_null_sub_category
FROM details;

 * postgresql://postgres:***@localhost/demo
1 rows affected.

[(1500, 1500, 1500, 1500, 1500, 1500)]

Last step before we begin our EDA is to check for orphan records in the tables  
Orders in the details table that do not have a corresponding entry in the orders table.

In [64]:
%%sql
SELECT COUNT(*)
FROM details d
LEFT JOIN orders o ON d.order_id = o.order_id
WHERE o.order_id IS NULL;

 * postgresql://postgres:***@localhost/demo
1 rows affected.

[(0,)]

Orders in the orders table that do not have a corresponding entry in the details table.

In [65]:
%%sql
SELECT COUNT(*)
FROM orders o
LEFT JOIN details d ON o.order_id = d.order_id
WHERE d.order_id IS NULL;

 * postgresql://postgres:***@localhost/demo
1 rows affected.

[(0,)]

We are now prepared to conduct our exploratory data analysis (EDA) on the dataset by addressing a series of key questions.

1. List the states along with their corresponding total amount of orders made, from highest to lowest

*SQL code comments*   
Selecting the columns of interest, aliasing the aggregate function sum() on the amount column using the clause 'as'.   
Joining the tables which are also aliased as o and d, on their common column which is 'order_id'.   
Whenever on our selection use aggregated columns like in our case the sum(d.amount) then we have to 'GROUP BY' all the other   
non aggregated columns (in our case the o.state column).   
'o.state' means that column state is extracted from the table orders which was aliased as o and the d.amount refers to the 'amount'   
column that comes from the 'details' table aliased as d.   
Finaly we order the resulting table by sorting the total_amount column in descending order(from highest to lowest)

In [66]:
%%sql
SELECT 
o.state, sum(d.amount) as total_amount
FROM details as d
INNER JOIN orders as o
ON d.order_id = o.order_id
GROUP BY o.state
ORDER BY total_amount DESC;

 * postgresql://postgres:***@localhost/demo
19 rows affected.

[('Maharashtra', Decimal('102498')),
 ('Madhya Pradesh', Decimal('87463')),
 ('Uttar Pradesh', Decimal('38362')),
 ('Delhi', Decimal('22957')),
 ('Rajasthan', Decimal('22334')),
 ('Gujarat', Decimal('21371')),
 ('Punjab', Decimal('16786')),
 ('West Bengal', Decimal('14328')),
 ('Kerala ', Decimal('13871')),
 ('Bihar', Decimal('13417')),
 ('Andhra Pradesh', Decimal('13256')),
 ('Karnataka', Decimal('12520')),
 ('Nagaland', Decimal('11993')),
 ('Jammu and Kashmir', Decimal('10829')),
 ('Haryana', Decimal('8863')),
 ('Himachal Pradesh', Decimal('8666')),
 ('Goa', Decimal('6705')),
 ('Tamil Nadu', Decimal('6276')),
 ('Sikkim', Decimal('5276'))]

2. Find the customer with the highest total amount of order, along with his/her order_id, state and city

*SQL code comments*      
This question cannot be answered by using only the two tables we have in our dataset. For this reason, we utilize 2 CTEs to reach the answer.   
We create the first CTE naming it 'order_totals' with the total_amount for every 'order_id'.   
Then, we create a second CTE named 'max_order', that selects the order_id from the first CTE that meets a specific criterion, that is the total_amount to be the maximum out of all orders.   
This results in only one order_id. The one which has the maximum total_amount.   
Finally, we select the columns of interest from our tables and join them with the result of the second CTE, so as to get the information only for the order 
with the maximum amount.   
In our final selection, since we are computing an aggregate column 'SUM(d.amount) as total_amount' **we should not forget** to group by, all the other   selected non aggregated columns

In [67]:
%%sql
WITH order_totals AS (
    SELECT 
        o.order_id,
        SUM(d.amount) AS total_amount
    FROM orders AS o
    INNER JOIN details AS d 
    ON o.order_id = d.order_id
    GROUP BY o.order_id
),
max_order AS (
    SELECT 
        order_id
    FROM order_totals
    WHERE total_amount = (SELECT MAX(total_amount) FROM order_totals)
)
SELECT 
    o.order_id, 
    o.customername, 
    SUM(d.amount) as total_amount, 
    o.state, 
    o.city
FROM details AS d
INNER JOIN orders AS o 
ON d.order_id = o.order_id
INNER JOIN max_order AS mo
ON o.order_id = mo.order_id
GROUP BY o.order_id, o.customername, o.state, o.city;

 * postgresql://postgres:***@localhost/demo
1 rows affected.

[('B-26055', 'Harivansh', Decimal('9902'), 'Uttar Pradesh', 'Mathura')]

3. Find the top 3 most profitable customers in each state

*SQL code comments*   
Using the same strategy as we did in the previous query. We create 2 CTEs, so as to make our final selection on the second CTE meeting a specific
criterion.   
A reasonable question would be, why do we need 2 CTEs to reach our answer?   
The reason is that in the second CTE named ranked_customers we make use of the Window function DENSE_RANK() that includes in the ORDER BY clause an aggregated column, and this cannot be completed in one query.   
For this reason we create the first CTE named customers_profit where we compute the aggregated column SUM(d.profit) AS total_profit, and in the second   
CTE we make use of the window function DENSE_RANK() with the aid of the aggregated column that is already created in the previous CTE.   
The rank is performed with respect to the total_profit, therefore in order to get the top 3 most profitable customers, we filter for the customers with   
rank 1,2 or 3 using profit_rank <= 3.

In [68]:
%%sql
WITH customers_profit AS (
    SELECT
        o.state,
        o.city,
        o.customername,
        SUM(d.profit) AS total_profit
    FROM orders AS o
    INNER JOIN details AS d
    ON o.order_id = d.order_id
    GROUP BY o.state, o.city, o.customername
),
ranked_customers AS (
    SELECT
        state,
        city,
        customername,
        total_profit,
        DENSE_RANK() OVER (PARTITION BY state ORDER BY total_profit DESC) AS profit_rank
    FROM customers_profit
)
SELECT
    state,
    city,
    customername,
    total_profit
FROM ranked_customers
WHERE profit_rank <= 3
ORDER BY state, city, profit_rank;

 * postgresql://postgres:***@localhost/demo
57 rows affected.

[('Andhra Pradesh', 'Hyderabad', 'Manju', Decimal('799')),
 ('Andhra Pradesh', 'Hyderabad', 'Krutika', Decimal('391')),
 ('Andhra Pradesh', 'Hyderabad', 'Devendra', Decimal('254')),
 ('Bihar', 'Patna', 'Amol', Decimal('745')),
 ('Bihar', 'Patna', 'Yogesh', Decimal('594')),
 ('Bihar', 'Patna', 'Akshay', Decimal('378')),
 ('Delhi', 'Delhi', 'Madhav', Decimal('864')),
 ('Delhi', 'Delhi', 'Diwakar', Decimal('420')),
 ('Delhi', 'Delhi', 'Amruta', Decimal('377')),
 ('Goa', 'Goa', 'Abhishek', Decimal('685')),
 ('Goa', 'Goa', 'Vikash', Decimal('278')),
 ('Goa', 'Goa', 'Kanak', Decimal('72')),
 ('Gujarat', 'Ahmedabad', 'Bharat', Decimal('1143')),
 ('Gujarat', 'Ahmedabad', 'Gaurav', Decimal('970')),
 ('Gujarat', 'Surat', 'Dashyam', Decimal('609')),
 ('Haryana', 'Chandigarh', 'Mukesh', Decimal('610')),
 ('Haryana', 'Chandigarh', 'Ankit', Decimal('352')),
 ('Haryana', 'Chandigarh', 'Aniket', Decimal('296')),
 ('Himachal Pradesh', 'Simla', 'Aastha', Decimal('873')),
 ('Himachal Pradesh', 'Simla', 'Pooja', Decimal('434')),
 ('Himachal Pradesh', 'Simla', 'Vandana', Decimal('179')),
 ('Jammu and Kashmir', 'Kashmir', 'Kirti', Decimal('281')),
 ('Jammu and Kashmir', 'Kashmir', 'Pinky', Decimal('189')),
 ('Jammu and Kashmir', 'Kashmir', 'Srishti', Decimal('137')),
 ('Karnataka', 'Bangalore', 'Arpita', Decimal('573')),
 ('Karnataka', 'Bangalore', 'Shruti', Decimal('232')),
 ('Karnataka', 'Bangalore', 'Ajay', Decimal('215')),
 ('Kerala ', 'Thiruvananthapuram', 'Shourya', Decimal('984')),
 ('Kerala ', 'Thiruvananthapuram', 'Hemant', Decimal('455')),
 ('Kerala ', 'Thiruvananthapuram', 'Sharda', Decimal('398')),
 ('Madhya Pradesh', 'Bhopal', 'Abhijeet', Decimal('948')),
 ('Madhya Pradesh', 'Indore', 'Pournamasi', Decimal('1027')),
 ('Madhya Pradesh', 'Indore', 'Shivanshu', Decimal('820')),
 ('Maharashtra', 'Mumbai', 'Bhishm', Decimal('1165')),
 ('Maharashtra', 'Pune', 'Sarita', Decimal('1183')),
 ('Maharashtra', 'Pune', 'Priyanka', Decimal('1043')),
 ('Nagaland', 'Kohima', 'Sudhir', Decimal('512')),
 ('Nagaland', 'Kohima', 'Kushal', Decimal('235')),
 ('Nagaland', 'Kohima', 'Nidhi', Decimal('205')),
 ('Punjab', 'Chandigarh', 'Shrichand', Decimal('1901')),
 ('Punjab', 'Chandigarh', 'Nripraj', Decimal('339')),
 ('Punjab', 'Chandigarh', 'Monica', Decimal('173')),
 ('Rajasthan', 'Jaipur', 'Paridhi', Decimal('570')),
 ('Rajasthan', 'Udaipur', 'Manisha', Decimal('240')),
 ('Rajasthan', 'Udaipur', 'Soumya', Decimal('234')),
 ('Sikkim', 'Gangtok', 'Mahima', Decimal('254')),
 ('Sikkim', 'Gangtok', 'K', Decimal('123')),
 ('Sikkim', 'Gangtok', 'Vineet', Decimal('92')),
 ('Tamil Nadu', 'Chennai', 'Aarushi', Decimal('2059')),
 ('Tamil Nadu', 'Chennai', 'Amisha', Decimal('438')),
 ('Tamil Nadu', 'Chennai', 'Kalyani', Decimal('78')),
 ('Uttar Pradesh', 'Mathura', 'Madan Mohan', Decimal('2166')),
 ('Uttar Pradesh', 'Mathura', 'Madhav', Decimal('984')),
 ('Uttar Pradesh', 'Mathura', 'Lalita', Decimal('400')),
 ('West Bengal', 'Kolkata', 'Parishi', Decimal('696')),
 ('West Bengal', 'Kolkata', 'Jesal', Decimal('516')),
 ('West Bengal', 'Kolkata', 'Pranjali', Decimal('486'))]

4. List the top 5 cities with the highest volume of orders

In [69]:
%%sql
SELECT 
city, count(order_id) as no_of_orders
FROM orders
GROUP BY city
ORDER BY no_of_orders DESC
LIMIT 5;

 * postgresql://postgres:***@localhost/demo
5 rows affected.

[('Indore', 71),
 ('Mumbai', 67),
 ('Chandigarh', 30),
 ('Pune', 27),
 ('Delhi', 24)]

5. Which state appears to be the most profitable? List it along with the least profitable state

In [70]:
%%sql
WITH states_profit AS (
		SELECT o.state, SUM(d.profit) AS total_profit
		FROM details AS d
		INNER JOIN orders AS o
		ON d.order_id = o.order_id
    	GROUP BY o.state
)
SELECT s.state, s.total_profit
FROM states_profit AS s
WHERE s.total_profit = (SELECT MAX(total_profit) FROM states_profit)
   OR s.total_profit = (SELECT MIN(total_profit) FROM states_profit);

 * postgresql://postgres:***@localhost/demo
2 rows affected.

[('Madhya Pradesh', Decimal('7382')), ('Rajasthan', Decimal('-323'))]

6. Which subcategories of products appear as the top 10 Sellers, with rescept to the volume of orders? List them along with their total profit

*SQL code comment*   
Since we are sorting in descending order for the order volume, using LIMIT 10, will result to the top 10 subcategories with the most volume of orders.

In [82]:
%%sql
SELECT 
sub_category, sum(quantity) as order_volume, sum(profit) as total_profit
FROM details
GROUP BY sub_category
ORDER BY order_volume DESC
LIMIT 10;

 * postgresql://postgres:***@localhost/demo
10 rows affected.

[('Saree', Decimal('795'), Decimal('4057')),
 ('Hankerchief', Decimal('741'), Decimal('1823')),
 ('Stole', Decimal('671'), Decimal('2431')),
 ('Furnishings', Decimal('310'), Decimal('-806')),
 ('T-shirt', Decimal('305'), Decimal('1500')),
 ('Phones', Decimal('304'), Decimal('1847')),
 ('Electronic Games', Decimal('297'), Decimal('-644')),
 ('Bookcases', Decimal('297'), Decimal('6516')),
 ('Printers', Decimal('291'), Decimal('8606')),
 ('Chairs', Decimal('277'), Decimal('1627'))]

It seems that something went probably wrong in the 'Electronic Games' and 'Furnishings' subcategories.   
Both sub-categories demonstrated negative profits, or operating loss
Let's compare the average profits for this top 10

In [72]:
%%sql
SELECT 
sub_category, ROUND(AVG(profit), 2) AS avg_profit
FROM details
WHERE sub_category IN (
    SELECT sub_category
    FROM (
        SELECT sub_category
        FROM details
        GROUP BY sub_category
        ORDER BY SUM(quantity) DESC
        LIMIT 10
    ) AS top_subcategories
)
GROUP BY sub_category
ORDER BY avg_profit DESC;

 * postgresql://postgres:***@localhost/demo
10 rows affected.

[('Printers', Decimal('116.30')),
 ('Bookcases', Decimal('82.48')),
 ('Phones', Decimal('22.25')),
 ('Chairs', Decimal('21.99')),
 ('T-shirt', Decimal('19.48')),
 ('Saree', Decimal('19.23')),
 ('Stole', Decimal('12.66')),
 ('Hankerchief', Decimal('9.25')),
 ('Electronic Games', Decimal('-8.15')),
 ('Furnishings', Decimal('-11.04'))]

Among the top 10 subcategory sellers, only 'Electronic Games' and 'Furnishings' exhibit a negative average profit, indicating an average operational loss. Aggressive discounts and sell-offs on specific titles within these subcategories could be a reasonable cause. Further investigation is needed to review the pricing policy and promotional tactics. Adjustments should be considered to avoid similar issues in the future.

7. Which payment method is more popular in total?

*SQL code comments*   
As we saw in previous queries, CTEs are valuable tools for helping us gain insights from the data tables.   
The main characteristic of CTEs is that they live and die within the query they are used in. They are not stored, so if you need to use them in a later query, you must repeat the code for each query that requires it.   
This is where a VIEW comes in handy. By creating a VIEW, you generate a 'virtual table' that is stored in the database as a query definition.   
When you query the VIEW, the database executes the underlying SQL query, pulling the necessary data from the original tables in real-time. 
Unlike CTEs, a VIEW will exist beyond a single query but across multiple sessions if needed.   
This allows you to reuse the VIEW in later queries or future sessions, without having to redefine it each time. You simply call it by its alias.

In [73]:
%%sql
DROP VIEW IF EXISTS payment_method_frequencies;
CREATE VIEW payment_method_frequencies AS
WITH payments_table AS (
    SELECT 
		d.order_id,
        paymentmode,
        CASE WHEN paymentmode = 'COD' THEN 'Cash' ELSE NULL END AS cash_method,
        CASE WHEN paymentmode = 'Credit Card' THEN 'Credit Card' ELSE NULL END AS credit_card,
        CASE WHEN paymentmode = 'UPI' THEN 'UPI' ELSE NULL END AS web_payment,
        CASE WHEN paymentmode = 'Debit Card' THEN 'Debit Card' ELSE NULL END AS debit_card,
        CASE WHEN paymentmode = 'EMI' THEN 'EMI' ELSE NULL END AS monthly_instalments
    FROM details as d
)
SELECT 
	order_id,
    COUNT(paymentmode) AS no_of_transcations,
    ROUND(COUNT(cash_method) * 100.0 / COUNT(*), 2) AS cash_percentage,
    ROUND(COUNT(credit_card) * 100.0 / COUNT(*), 2) AS credit_card_percentage,
    ROUND(COUNT(web_payment) * 100.0 / COUNT(*), 2) AS web_payment_percentage,
    ROUND(COUNT(debit_card) * 100.0 / COUNT(*), 2) AS debit_card_percentage,
    ROUND(COUNT(monthly_instalments) * 100.0 / COUNT(*), 2) AS monthly_instalments_percentage
FROM payments_table
GROUP BY order_id;

SELECT round(avg(cash_percentage), 2) as cash_percentage, 
round(avg(credit_card_percentage), 2) as credit_card_percentage,
round(avg(web_payment_percentage), 2) as web_payment_percentage, 
round(avg(debit_card_percentage), 2) as debit_card_percentage, 
round(avg(monthly_instalments_percentage), 2) as monthly_instalments_percentage
FROM payment_method_frequencies;

 * postgresql://postgres:***@localhost/demo
Done.
Done.
1 rows affected.

[(Decimal('45.39'), Decimal('10.63'), Decimal('22.45'), Decimal('13.65'), Decimal('7.89'))]

Nearly half of the transactions are performed in cash, with the second most popular method   
being web payments (likely through mobile or internet banking), at around 22%.

8. Does the payment method frequency change across the states and cities?

In [74]:
%%sql
SELECT 
    o.state, 
    ROUND(AVG(m.cash_percentage),2) AS cash_percentage,
    ROUND(AVG(m.credit_card_percentage),2) AS credit_card_percentage,
    ROUND(AVG(m.web_payment_percentage),2) AS web_payment_percentage,
    ROUND(AVG(m.debit_card_percentage),2) AS debit_card_percentage,
    ROUND(AVG(m.monthly_instalments_percentage),2) AS monthly_instalments_percentage 
FROM orders AS o
INNER JOIN payment_method_frequencies AS m
ON o.order_id = m.order_id
GROUP BY o.state;

 * postgresql://postgres:***@localhost/demo
19 rows affected.

[('Haryana', Decimal('54.40'), Decimal('8.57'), Decimal('18.93'), Decimal('16.31'), Decimal('1.79')),
 ('Madhya Pradesh', Decimal('50.01'), Decimal('10.49'), Decimal('22.04'), Decimal('10.23'), Decimal('7.24')),
 ('Tamil Nadu', Decimal('42.71'), Decimal('11.46'), Decimal('35.42'), Decimal('10.42'), Decimal('0.00')),
 ('Rajasthan', Decimal('38.21'), Decimal('10.42'), Decimal('23.24'), Decimal('19.52'), Decimal('8.61')),
 ('Sikkim', Decimal('27.78'), Decimal('0.00'), Decimal('34.44'), Decimal('26.67'), Decimal('11.11')),
 ('Maharashtra', Decimal('47.67'), Decimal('8.71'), Decimal('23.57'), Decimal('13.94'), Decimal('6.10')),
 ('Bihar', Decimal('39.69'), Decimal('10.68'), Decimal('16.35'), Decimal('17.14'), Decimal('16.15')),
 ('Jammu and Kashmir', Decimal('51.94'), Decimal('14.74'), Decimal('9.60'), Decimal('21.10'), Decimal('2.62')),
 ('Kerala ', Decimal('38.30'), Decimal('12.01'), Decimal('18.89'), Decimal('14.97'), Decimal('15.83')),
 ('Gujarat', Decimal('39.71'), Decimal('16.58'), Decimal('20.58'), Decimal('13.44'), Decimal('9.69')),
 ('Goa', Decimal('53.12'), Decimal('9.52'), Decimal('31.80'), Decimal('4.76'), Decimal('0.79')),
 ('Punjab', Decimal('46.33'), Decimal('7.33'), Decimal('29.33'), Decimal('8.33'), Decimal('8.67')),
 ('Himachal Pradesh', Decimal('61.43'), Decimal('9.52'), Decimal('8.33'), Decimal('16.67'), Decimal('4.05')),
 ('Nagaland', Decimal('34.00'), Decimal('15.74'), Decimal('21.26'), Decimal('17.96'), Decimal('11.04')),
 ('Karnataka', Decimal('38.04'), Decimal('16.85'), Decimal('25.66'), Decimal('9.58'), Decimal('9.88')),
 ('Delhi', Decimal('47.83'), Decimal('10.28'), Decimal('25.07'), Decimal('11.78'), Decimal('5.04')),
 ('Uttar Pradesh', Decimal('49.65'), Decimal('16.46'), Decimal('18.25'), Decimal('9.51'), Decimal('6.13')),
 ('West Bengal', Decimal('47.65'), Decimal('3.49'), Decimal('16.74'), Decimal('17.50'), Decimal('14.62')),
 ('Andhra Pradesh', Decimal('25.85'), Decimal('13.36'), Decimal('29.63'), Decimal('17.25'), Decimal('13.92'))]

9. There is significant variation in payment methods across different states. This variation can be quantified by calculating the standard deviation, as well as the minimum and maximum average percentages for each payment method across the states.

In [75]:
%%sql
WITH state_averages AS (
    SELECT 
        o.state,
        AVG(m.cash_percentage) AS avg_cash_p,
        AVG(m.credit_card_percentage) AS avg_credit_card_p,
        AVG(m.web_payment_percentage) AS avg_web_payment_p,
        AVG(m.debit_card_percentage) AS avg_debit_card_p,
        AVG(m.monthly_instalments_percentage) AS avg_monthly_instalments_p
    FROM orders AS o
    INNER JOIN payment_method_frequencies AS m
    ON o.order_id = m.order_id
    GROUP BY o.state
)
SELECT 
    ROUND(STDDEV(avg_cash_p), 2) AS std_cash_p,
    ROUND(MIN(avg_cash_p), 2) AS min_cash_p,
    ROUND(MAX(avg_cash_p), 2) AS max_cash_p,
    ROUND(STDDEV(avg_credit_card_p), 2) AS std_credit_card_p,
    ROUND(MIN(avg_credit_card_p), 2) AS min_credit_p,
    ROUND(MAX(avg_credit_card_p), 2) AS max_credit_card_p,
    ROUND(STDDEV(avg_web_payment_p), 2) AS std_web_payment_p,
    ROUND(MIN(avg_web_payment_p), 2) AS min_web_payment_p,
    ROUND(MAX(avg_web_payment_p), 2) AS max_web_payment_p,
    ROUND(STDDEV(avg_debit_card_p), 2) AS std_debit_card_p,
    ROUND(MIN(avg_debit_card_p), 2) AS min_debit_card_p,
    ROUND(MAX(avg_debit_card_p), 2) AS max_debit_card_p,
    ROUND(STDDEV(avg_monthly_instalments_p), 2) AS std_monthly_instalments_p,
    ROUND(MIN(avg_monthly_instalments_p), 2) AS min_monthly_instalments_p,
    ROUND(MAX(avg_monthly_instalments_p), 2) AS max_monthly_instalments_p
FROM state_averages;

 * postgresql://postgres:***@localhost/demo
1 rows affected.

[(Decimal('9.15'), Decimal('25.85'), Decimal('61.43'), Decimal('4.38'), Decimal('0.00'), Decimal('16.85'), Decimal('7.45'), Decimal('8.33'), Decimal('35.42'), Decimal('5.20'), Decimal('4.76'), Decimal('26.67'), Decimal('4.99'), Decimal('0.00'), Decimal('16.15'))]

Our initial observation of significant variation in payment methods across the states was confirmed by the computed standard deviation. Additional data on demographics and the financial status of each state and its residents would be required for a more granular analysis

10. Do product categories also influence the choice of payment methods? How the payment method ratios are distributed across the product categories

In [76]:
%%sql
SELECT d.category,
       COUNT(m.order_id) AS total_orders,
       ROUND(AVG(m.cash_percentage), 2) AS avg_cash_percentage,
       ROUND(AVG(m.credit_card_percentage), 2) AS avg_credit_card_percentage,
       ROUND(AVG(m.web_payment_percentage), 2) AS avg_web_payment_percentage,
       ROUND(AVG(m.debit_card_percentage), 2) AS avg_debit_card_percentage,
       ROUND(AVG(m.monthly_instalments_percentage), 2) AS avg_monthly_instalments_percentage
FROM payment_method_frequencies AS m
INNER JOIN details AS d
ON m.order_id = d.order_id
GROUP BY d.category
ORDER BY d.category;

 * postgresql://postgres:***@localhost/demo
3 rows affected.

[('Clothing', 949, Decimal('46.75'), Decimal('9.55'), Decimal('21.96'), Decimal('14.20'), Decimal('7.54')),
 ('Electronics', 308, Decimal('43.28'), Decimal('13.26'), Decimal('20.49'), Decimal('13.36'), Decimal('9.61')),
 ('Furniture', 243, Decimal('44.06'), Decimal('12.96'), Decimal('24.49'), Decimal('10.73'), Decimal('7.77'))]

No significant difference is observed in the average percentage of payment methods across
the different categories of products.

11. Could the amount of order affect the choice of payment method used?

In [77]:
%%sql
SELECT
    CASE
        WHEN d.amount < 100 THEN 'Small'
        WHEN d.amount BETWEEN 100 AND 1000 THEN 'Medium'
        ELSE 'High'
    END AS amount_category,
    COUNT(m.order_id) AS total_orders,
    ROUND(AVG(m.cash_percentage), 2) AS avg_cash_percentage,
    ROUND(AVG(m.credit_card_percentage), 2) AS avg_credit_card_percentage,
    ROUND(AVG(m.web_payment_percentage), 2) AS avg_web_payment_percentage,
    ROUND(AVG(m.debit_card_percentage), 2) AS avg_debit_card_percentage,
    ROUND(AVG(m.monthly_instalments_percentage), 2) AS avg_monthly_instalments_percentage
FROM payment_method_frequencies AS m
INNER JOIN details AS d
ON m.order_id = d.order_id
GROUP BY amount_category
ORDER BY amount_category;

 * postgresql://postgres:***@localhost/demo
3 rows affected.

[('High', 99, Decimal('33.64'), Decimal('20.15'), Decimal('18.30'), Decimal('9.42'), Decimal('18.48')),
 ('Medium', 739, Decimal('45.28'), Decimal('11.71'), Decimal('21.15'), Decimal('13.90'), Decimal('7.97')),
 ('Small', 662, Decimal('47.75'), Decimal('8.54'), Decimal('23.66'), Decimal('13.59'), Decimal('6.46'))]

The results are interesting but somewhat anticipated.   
As the order amount increases, the use of cash payments decreases.   
Conversely, credit card usage increases with higher order amounts, becoming a more preferred method.   
Debit cards and web payments show minimal changes for small and medium amounts but slightly decline for higher amounts.   
Finally, the need for and use of monthly instalments nearly triples when the order amount becomes very high.

12. Rank the top 5 customers in each state, from the most to least profitable

In [78]:
%%sql
WITH RankedCustomers AS (
    SELECT 
        customername, 
        state, 
        profit,
        DENSE_RANK() OVER (PARTITION BY state ORDER BY profit DESC) AS profit_rank
    FROM orders AS o
    INNER JOIN details AS d
    ON o.order_id = d.order_id
)
SELECT 
state, customername, profit, profit_rank
FROM RankedCustomers
WHERE profit_rank <= 5
ORDER BY state, profit_rank;

 * postgresql://postgres:***@localhost/demo
95 rows affected.

[('Andhra Pradesh', 'Manju', 547, 1),
 ('Andhra Pradesh', 'Krutika', 352, 2),
 ('Andhra Pradesh', 'Devendra', 254, 3),
 ('Andhra Pradesh', 'Shishu', 148, 4),
 ('Andhra Pradesh', 'Soumyabrata', 144, 5),
 ('Bihar', 'Amol', 701, 1),
 ('Bihar', 'Yogesh', 594, 2),
 ('Bihar', 'Akshay', 312, 3),
 ('Bihar', 'Akshay', 215, 4),
 ('Bihar', 'Sonal', 161, 5),
 ('Delhi', 'Yohann', 342, 1),
 ('Delhi', 'Diwakar', 323, 2),
 ('Delhi', 'Madhav', 305, 3),
 ('Delhi', 'Amruta', 251, 4),
 ('Delhi', 'Madhav', 208, 5),
 ('Goa', 'Abhishek', 215, 1),
 ('Goa', 'Vikash', 206, 2),
 ('Goa', 'Abhishek', 199, 3),
 ('Goa', 'Abhishek', 192, 4),
 ('Goa', 'Kanak', 76, 5),
 ('Gujarat', 'Bharat', 1148, 1),
 ('Gujarat', 'Gaurav', 721, 2),
 ('Gujarat', 'Dashyam', 568, 3),
 ('Gujarat', 'Shardul', 340, 4),
 ('Gujarat', 'Kartik', 225, 5),
 ('Haryana', 'Mukesh', 447, 1),
 ('Haryana', 'Ankit', 352, 2),
 ('Haryana', 'Aniket', 225, 3),
 ('Haryana', 'Anjali', 206, 4),
 ('Haryana', 'Mukesh', 101, 5),
 ('Himachal Pradesh', 'Aastha', 782, 1),
 ('Himachal Pradesh', 'Pooja', 503, 2),
 ('Himachal Pradesh', 'Aastha', 64, 3),
 ('Himachal Pradesh', 'Vandana', 56, 4),
 ('Himachal Pradesh', 'Vandana', 54, 5),
 ('Jammu and Kashmir', 'Kirti', 208, 1),
 ('Jammu and Kashmir', 'Vijay', 193, 2),
 ('Jammu and Kashmir', 'Pinky', 179, 3),
 ('Jammu and Kashmir', 'Pinky', 151, 4),
 ('Jammu and Kashmir', 'Srishti', 137, 5),
 ('Karnataka', 'Arpita', 573, 1),
 ('Karnataka', 'Shruti', 262, 2),
 ('Karnataka', 'Vini', 183, 3),
 ('Karnataka', 'Ajay', 170, 4),
 ('Karnataka', 'Noopur', 99, 5),
 ('Kerala ', 'Shourya', 564, 1),
 ('Kerala ', 'Girase', 536, 2),
 ('Kerala ', 'Hemant', 421, 3),
 ('Kerala ', 'Snel', 371, 4),
 ('Kerala ', 'Sharda', 346, 5),
 ('Madhya Pradesh', 'Sauptik', 802, 1),
 ('Madhya Pradesh', 'Pournamasi', 742, 2),
 ('Madhya Pradesh', 'Bhawna', 658, 3),
 ('Madhya Pradesh', 'Abhijeet', 567, 4),
 ('Madhya Pradesh', 'Anudeep', 527, 5),
 ('Maharashtra', 'Vrinda', 1151, 1),
 ('Maharashtra', 'Savi', 980, 2),
 ('Maharashtra', 'Sarita', 712, 3),
 ('Maharashtra', 'Priyanka', 680, 4),
 ('Maharashtra', 'Uudhav', 665, 5),
 ('Nagaland', 'Sudhir', 460, 1),
 ('Nagaland', 'Farah', 318, 2),
 ('Nagaland', 'Farah', 102, 3),
 ('Nagaland', 'Nidhi', 77, 4),
 ('Nagaland', 'Nidhi', 75, 5),
 ('Punjab', 'Shrichand', 1303, 1),
 ('Punjab', 'Shrichand', 624, 2),
 ('Punjab', 'Nripraj', 199, 3),
 ('Punjab', 'Paromita', 154, 4),
 ('Punjab', 'Monica', 119, 5),
 ('Rajasthan', 'Manisha', 240, 1),
 ('Rajasthan', 'Paridhi', 239, 2),
 ('Rajasthan', 'Soumya', 234, 3),
 ('Rajasthan', 'Paridhi', 143, 4),
 ('Rajasthan', 'Divsha', 97, 5),
 ('Sikkim', 'Mahima', 254, 1),
 ('Sikkim', 'K', 123, 2),
 ('Sikkim', 'Amit', 50, 3),
 ('Sikkim', 'Amit', 48, 4),
 ('Sikkim', 'Vineet', 41, 5),
 ('Tamil Nadu', 'Aarushi', 1864, 1),
 ('Tamil Nadu', 'Amisha', 392, 2),
 ('Tamil Nadu', 'Aarushi', 385, 3),
 ('Tamil Nadu', 'Amisha', 153, 4),
 ('Tamil Nadu', 'Aarushi', 107, 5),
 ('Uttar Pradesh', 'Madan Mohan', 1698, 1),
 ('Uttar Pradesh', 'Madhav', 1050, 2),
 ('Uttar Pradesh', 'Madan Mohan', 433, 3),
 ('Uttar Pradesh', 'Lalita', 247, 4),
 ('Uttar Pradesh', 'Manshul', 212, 5),
 ('West Bengal', 'Pranjali', 486, 1),
 ('West Bengal', 'Ayush', 292, 2),
 ('West Bengal', 'Jesal', 198, 3),
 ('West Bengal', 'Parishi', 195, 4),
 ('West Bengal', 'Atharv', 170, 5)]

13. How has the profit evolved over the year, quarter by quarter?

In [79]:
%%sql
WITH quarter_profit AS (
    SELECT
        EXTRACT(QUARTER FROM TO_DATE(order_date, 'DD-MM-YYYY')) AS quarter,
        SUM(profit) AS total_quarter_profit
    FROM details AS d
    INNER JOIN orders AS o
    ON d.order_id = o.order_id
    GROUP BY
        EXTRACT(QUARTER FROM TO_DATE(order_date, 'DD-MM-YYYY'))
),
cumulative_profits AS (
    SELECT 
        quarter,
        total_quarter_profit,
        SUM(total_quarter_profit) OVER (ORDER BY quarter) AS cumulative_quarter_profit
    FROM quarter_profit
)
SELECT
quarter, total_quarter_profit, cumulative_quarter_profit
FROM cumulative_profits
ORDER BY quarter;

 * postgresql://postgres:***@localhost/demo
4 rows affected.

[(Decimal('1'), Decimal('25942'), Decimal('25942')),
 (Decimal('2'), Decimal('882'), Decimal('26824')),
 (Decimal('3'), Decimal('-1469'), Decimal('25355')),
 (Decimal('4'), Decimal('11608'), Decimal('36963'))]

The first quarter significantly impacts overall profitability, accounting for around 70% of 
the total profit. Profitability declines in the second quarter and turns into a loss in the 
third quarter. The company returns to profitability in the fourth quarter. Without more 
information/data about the company's main activity, we cannot explore the causes of this
seasonality further. Also diving deeper and computing the company's result over time across all
19 states will not be an easy task without the aid of visualizations.   
One more thing we can do is to check monthly profit trends and examine how profitability 
varies across different product categories.

14. How has the company's profit evolved over the year, month by month?

In [80]:
%%sql
WITH MonthlyProfits AS (
    SELECT
        EXTRACT(MONTH FROM TO_DATE(order_date, 'DD-MM-YYYY')) AS month,
        SUM(profit) AS total_monthly_profit
    FROM orders AS o
    INNER JOIN details AS d
    ON o.order_id = d.order_id
    GROUP BY EXTRACT(MONTH FROM TO_DATE(order_date, 'DD-MM-YYYY'))
),
CumulativeProfits AS (
    SELECT
        month,
        total_monthly_profit,
        SUM(total_monthly_profit) OVER (ORDER BY month) AS cumulative_profit
    FROM MonthlyProfits
)
SELECT
month, total_monthly_profit, cumulative_profit
FROM CumulativeProfits
ORDER BY month;

 * postgresql://postgres:***@localhost/demo
12 rows affected.

[(Decimal('1'), Decimal('9684'), Decimal('9684')),
 (Decimal('2'), Decimal('8465'), Decimal('18149')),
 (Decimal('3'), Decimal('7793'), Decimal('25942')),
 (Decimal('4'), Decimal('4192'), Decimal('30134')),
 (Decimal('5'), Decimal('-3730'), Decimal('26404')),
 (Decimal('6'), Decimal('420'), Decimal('26824')),
 (Decimal('7'), Decimal('-2138'), Decimal('24686')),
 (Decimal('8'), Decimal('2068'), Decimal('26754')),
 (Decimal('9'), Decimal('-1399'), Decimal('25355')),
 (Decimal('10'), Decimal('2959'), Decimal('28314')),
 (Decimal('11'), Decimal('10253'), Decimal('38567')),
 (Decimal('12'), Decimal('-1604'), Decimal('36963'))]

During the months of May, July, September, and December, the company produced a negative result(loss).   
Let's move one step down and see what happened during these months.

15. Compute the total profit for the identified problematic months, categorized by product category

In [81]:
%%sql
SELECT 
SUM(profit) AS total_profit, category
FROM details AS d
INNER JOIN orders AS o 
ON d.order_id = o.order_id
WHERE EXTRACT(MONTH FROM TO_DATE(order_date, 'DD-MM-YYYY')) IN (5, 7, 9, 12)
GROUP BY category;

 * postgresql://postgres:***@localhost/demo
3 rows affected.

[(Decimal('-1046'), 'Furniture'),
 (Decimal('-6922'), 'Electronics'),
 (Decimal('-903'), 'Clothing')]

The result of the above query indicates a severe loss impact associated with the 'Electronics' category. This issue has been previously identified in earlier queries. A detailed investigation into this category is recommended to address the underlying causes and develop targeted strategies for improvement.

**Closing EDA comments and proposals**

Based on the exploratory data analysis, we recommend the following business proposals:   
**Re-evaluate Pricing Policy**   
Conduct a thorough assessment of the current pricing strategy to
ensure alignment with profitability objectives. Consider adjusting pricing structures to 
improve margins.   
**Adjust Promotional Campaigns**   
Review and optimize promotional strategies, with particular 
attention to discount practices. Ensure that discount strategies are effective in attracting
customers while maintaining profitability.   
**Promote Non-Cash Payment Methods**   
Increase efforts to promote non-cash payment methods, which
are associated with higher order amounts. This could involve providing incentives for using
credit cards, web payments, or monthly installments